Lab - Configure VLANs and Trunking

Background / Scenario
Modern switches use VLANs (Virtual Local-Area Networks) to enhance network performance by dividing large broadcast domains into smaller ones. VLANs improve security by controlling host communication and simplifying network design. VLAN trunks allow VLAN traffic to pass between devices while maintaining segmentation. In this lab, you will configure VLANs, verify functionality, and create a trunk link.

Part 1: Build the Network and Configure Basic Device Settings
Device Setup Instructions
1. Cable the network as shown in the topology diagram.
Device: Physical switches and PCs
Action: Use Ethernet cables to connect devices according to the diagram.
2. Configure basic switch settings.
Device: Cisco 2960 Switches
Commands:
Console into the switch.
shell
Copy
Edit
Switch> enable
Enter global configuration mode.
arduino
Copy
Edit
Switch# config terminal
Assign a hostname.
arduino
Copy
Edit
Switch(config)# hostname S1  // On Switch 1
Switch(config)# hostname S2  // On Switch 2
Disable DNS lookup.
arduino
Copy
Edit
S1(config)# no ip domain-lookup
S2(config)# no ip domain-lookup
Assign encrypted privileged EXEC password.
arduino
Copy
Edit
S1(config)# enable secret class
S2(config)# enable secret class
Set console and VTY passwords.
arduino
Copy
Edit
S1(config)# line console 0
S1(config-line)# password cisco
S1(config-line)# login

S1(config)# line vty 0 4
S1(config-line)# password cisco
S1(config-line)# login

Repeat for S2.
Encrypt plaintext passwords.
arduino
Copy
Edit
S1(config)# service password-encryption
S2(config)# service password-encryption
Configure a warning banner.
arduino
Copy
Edit
S1(config)# banner motd $ Authorized Users Only! $
S2(config)# banner motd $ Authorized Users Only! $
Assign IP addresses to VLAN 1.
arduino
Copy
Edit
S1(config)# interface vlan 1
S1(config-if)# ip address 192.168.1.11 255.255.255.0
S1(config-if)# no shutdown

S2(config)# interface vlan 1
S2(config-if)# ip address 192.168.1.12 255.255.255.0
S2(config-if)# no shutdown
Shut down unused interfaces.
arduino
Copy
Edit
S1(config)# interface range f0/2-5, f0/7-24, g0/1-2
S1(config-if-range)# shutdown

S2(config)# interface range f0/2-17, f0/18-24, g0/1-2
S2(config-if-range)# shutdown
Set the clock.
shell
Copy
Edit
S1# clock set 15:30:00 28 October 2024
S2# clock set 15:30:00 28 October 2024
Save configurations.
lua
Copy
Edit
S1# copy running-config startup-config
S2# copy running-config startup-config
3. Configure PC hosts.
Device: PCs
Actions: Configure IP addresses for each PC according to the topology.
4. Test connectivity.
Device: PCs and switches
Action: Use the ping command to test:
PC-A to PC-B: Successful? Yes
PC-A to S1: Successful? No
PC-B to S2: Successful? No
S1 to S2: Successful? Yes
Analysis: Pings fail between devices on different subnets due to the lack of a configured default gateway.
Part 2: Create VLANs and Assign Switch Ports
1. Create VLANs.
Device: Switches (S1 and S2)
Commands:
On S1:
scss
Copy
Edit
S1(config)# vlan 10
S1(config-vlan)# name Operations
S1(config)# vlan 20
S1(config-vlan)# name Parking_Lot
S1(config)# vlan 99
S1(config-vlan)# name Management
S1(config)# vlan 1000
S1(config-vlan)# name Native
Repeat the same commands on S2.
2. Verify VLAN configuration.
Command:
arduino
Copy
Edit
S1# show vlan brief
Questions:
What is the default VLAN? VLAN 1
What ports are assigned to the default VLAN? All unused ports are in VLAN 1.
3. Assign VLANs to switch interfaces.
Device: Switch S1
Commands:
Assign PC-A to VLAN 10.
arduino
Copy
Edit
S1(config)# interface f0/6
S1(config-if)# switchport mode access
S1(config-if)# switchport access vlan 10
Move the switch management IP to VLAN 99.
arduino
Copy
Edit
S1(config)# interface vlan 1
S1(config-if)# no ip address
S1(config-if)# exit
S1(config)# interface vlan 99
S1(config-if)# ip address 192.168.1.11 255.255.255.0
S1(config-if)# no shutdown
Verify with:
arduino
Copy
Edit
S1# show vlan brief
4. Verify VLAN 99 status.
Command:
kotlin
Copy
Edit
S1# show ip interface brief
Question: What is the status of VLAN 99?
Answer: VLAN 99 is up/down. It is up administratively but down because no active port is assigned to this VLAN.
